Repository: yaron3/teacherInMinute
Catalog: teacher-minute/Sources/TeacherMinute/Resources/Localizable.xcstrings
Source language: en
Languages: he

source: and
he: ו

source: Opening...
he: בתהליך…

source: (127 reviews)
he: (127 ביקורות)

source: /min
he: /דקה

source: %@ subtopics
he: %@ תתי־נושאים

source: %d / 10 min chars
he: %d / 10 דקות תווים

source: %d / 10 minimum characters
he: %d / 10 תווים מינימום

source: %d completed
he: %d שיעורים הושלמו

source: %d days ago
he: לפני %d ימים

source: %d hrs ago
he: לפני %d שעות

source: %d min
he: %d דק׳

source: %d min ago
he: לפני %d דק׳

source: %d min remaining
he: נשארו %d דקות

source: %d mins
he: %d דק׳

source: %d mins tutored
he: %d דקות לימוד

source: %d seconds ago
he: לפני %d שניות

source: %d selected
he: %d נבחרו

source: %d subjects
he: %d מקצועות

source: %d subtopics
he: %d תתי-נושאים

source: %d taught
he: %d שיעורים שלימדת

source: %d Waiting
he: %d ממתינים

source: + Add
he: + הוסף

source: ⚡ %@/min
he: ⚡ %@/דק׳

source: 1 day ago
he: לפני יום

source: 1 hr ago
he: לפני שעה

source: 1 min
he: דקה אחת

source: 1 min ago
he: לפני דקה

source: 1 second ago
he: לפני שנייה אחת

source: 1 subject
he: מקצוע אחד

source: 1 subtopic
he: תת-נושא אחד

source: About
he: אודות

source: ABOUT
he: אודות

source: Accept Question
he: קבל שאלה

source: Accept the terms to continue
he: יש לאשר את התנאים כדי להמשיך

source: ACCOUNT
he: חשבון

source: Account & Security
he: חשבון ואבטחה

source: ACCOUNT & SECURITY
he: חשבון ואבטחה

source: Account Info
he: פרטי חשבון

source: Add a title and description before submitting.
he: הוסף כותרת ותיאור לפני השליחה.

source: Add Now
he: הוסף עכשיו

source: Adult Learner
he: בוגר

source: Algebra
he: אלגברה

source: All teachers are busy right now. Try again in a few minutes.
he: כל המורים עסוקים כרגע. נסה שוב בעוד כמה דקות.

source: All Time
he: כל הזמן

source: Allow incoming messages from a teacher while not in a call
he: אפשר הודעות נכנסות ממורה כשאני לא בשיחה

source: Allow Microphone
he: אפשר מיקרופון

source: Already have an account?
he: כבר יש לך חשבון?

source: Already have an account? Log In
he: כבר יש לך חשבון? התחבר

source: App Preview
he: תצוגה מקדימה של האפליקציה

source: Appearance
he: מראה

source: Are you sure you want to log out?
he: האם אתה בטוח שברצונך להתנתק?

source: Arithmetic
he: חשבון

source: Ask a math teacher
he: שאל מורה למתמטיקה

source: Ask a Teacher
he: שאל מורה

source: audio
he: שמע

source: Audio + Text
he: אודיו + טקסט

source: Audio message
he: הודעת שמע

source: Back Side
he: צד אחורי

source: Back to Log In
he: חזרה להתחברות

source: Bank details and payout history will be available here.
he: פרטי בנק והיסטוריית תשלומים יהיו זמינים כאן.

source: Board
he: לוח

source: British Pound
he: לירה שטרלינג

source: By continuing, you agree to our
he: בהמשך, אתה מסכים ל־

source: Calculus
he: חדו״א

source: Cam
he: מצלמה

source: Camera
he: מצלמה

source: Camera Disabled
he: מצלמה כבויה

source: Camera Enabled
he: מצלמה פועלת

source: Cancel
he: ביטול

source: Cancel Session
he: בטל שיעור

source: Cards and billing history will be available here.
he: כרטיסים והיסטוריית חיובים יהיו זמינים כאן.

source: Change contact info
he: שנה פרטי קשר

source: Change Password
he: שינוי סיסמה

source: Chat Messages
he: הודעות צ׳אט

source: Checking your subjects…
he: בודק את הנושאים שלך…

source: Checking…
he: בודק…

source: Checkout
he: קנה

source: Choose a subject area, then select at least one subtopic students can request.
he: בחר תחום לימוד, ואז בחר לפחות תת־נושא אחד שתלמידים יכולים לבקש.

source: Choose grades
he: בחר כיתות

source: Choose one or more subjects to see subtopics.
he: בחר נושא אחד או יותר כדי לראות תתי־נושאים.

source: Choose subjects
he: בחר מקצועות

source: Choose Your Role
he: בחר את התפקיד שלך

source: Clear
he: נקה

source: College
he: אוניברסיטה / מכללה

source: Complete your profile
he: השלם את הפרופיל שלך

source: Completed lesson with %@.
he: שיעור שהושלם עם %@.

source: Connect & Learn
he: התחבר ולמד

source: Connect instantly with verified math teachers for on-demand help, or share your expertise.
he: התחבר מיידית למורים מאומתים למתמטיקה לקבלת עזרה לפי דרישה, או שתף את המומחיות שלך.

source: Connected
he: מחובר

source: Connection
he: חיבור

source: Contact Support
he: צור קשר עם התמיכה

source: Contact Us
he: צור קשר

source: Continue
he: המשך

source: Continue Anyway
he: המשך בכל זאת

source: Continue Setup
he: המשך הגדרות

source: Continue to Onboarding
he: המשך לקליטה

source: Continue to Role Selection
he: המשך לבחירת תפקיד

source: Could not load PayPal payout settings.
he: לא ניתן לטעון את הגדרות התשלום ב־PayPal.

source: Could not open payment settings.
he: לא ניתן היה לפתוח את הגדרות התשלום.

source: Could not read selected image
he: לא ניתן היה לקרוא את התמונה שנבחרה

source: Could Not Send Question
he: לא ניתן לשלוח את השאלה

source: Could not send your message.
he: לא ניתן היה לשלוח את ההודעה שלך.

source: Could not start checkout.
he: לא ניתן היה להתחיל תשלום.

source: Could not update PayPal payout settings.
he: לא ניתן לעדכן את הגדרות התשלום ב־PayPal.

source: Create Account
he: יצירת חשבון

source: Currency
he: מטבע

source: Dark
he: כהה

source: Data to be sent
he: הנתונים שיישלחו

source: Date of Birth
he: תאריך לידה

source: Decline
he: דחה

source: Delete
he: מחק

source: Delete Account
he: מחיקת חשבון

source: Description
he: תיאור

source: Device Permissions
he: הרשאות מכשיר

source: Device Type
he: סוג מכשיר

source: Disabled
he: לא מאופשר

source: Don't have an account?
he: אין לך חשבון?

source: Done
he: סיום

source: Earn while teaching
he: הרווח בזמן ההוראה

source: Earnings Snapshot
he: סיכום הכנסות

source: Edit
he: עריכה

source: Edit Profile
he: ערוך פרופיל

source: Edit Subjects
he: ערוך נושאים

source: Email
he: אימייל

source: Enable
he: מאופשר

source: Enable for video tutoring.
he: הפעל לשיעורי וידאו.

source: Enabled
he: מאופשר

source: End
he: סיום

source: Ensure good lighting
he: ודא תאורה טובה

source: Enter a valid email address.
he: הזן כתובת אימייל תקינה.

source: Enter a valid PayPal email address.
he: יש להזין כתובת אימייל תקינה ל־PayPal.

source: Enter your email
he: הזן את האימייל שלך

source: Enter your email address first.
he: הכנס כתובת אימייל בשדה האימייל

source: Enter your email or phone number and we'll send you instructions to reset your password.
he: הזן את האימייל או מספר הטלפון שלך ונשלח לך הוראות לאיפוס הסיסמה.

source: Enter your password
he: הזן את הסיסמה שלך

source: Euro
he: אירו

source: Find a Teacher
he: מצא מורה

source: Forgot Password?
he: שכחת סיסמה?

source: Front Side
he: צד קדמי

source: Full Name
he: שם מלא

source: Geometry
he: גאומטריה

# Get instant alerts when a teacher accepts your request or replies.
source: Get instant alerts\nwhen a teacher\naccepts your\nrequest or replies.
he: קבל התראות שמקבלים את השיחה שלך

source: Go online to start receiving student requests and earn money.
he: עבור למצב מקוון כדי להתחיל לקבל בקשות מתלמידים ולהרוויח כסף.

source: Government ID
he: תעודה מזהה ממשלתית

source: Government ID – Back
he: תעודה מזהה ממשלתית - צד אחורי

source: Government ID – Front
he: תעודה מזהה ממשלתית - צד קדמי

source: Grade
he: כיתה

source: Grade 1
he: כיתה א׳

source: Grade 2
he: כיתה ב׳

source: Grade 3
he: כיתה ג׳

source: Grade 4
he: כיתה ד׳

source: Grade 5
he: כיתה ה׳

source: Grade 6
he: כיתה ו׳

source: Grade 7
he: כיתה ז׳

source: Grade 8
he: כיתה ח׳

source: Grade 9
he: כיתה ט׳

source: Grade 10
he: כיתה י׳

source: Grade 11
he: כיתה י״א

source: Grade 12
he: כיתה י״ב

source: Grade Levels Taught
he: כיתות שאני מלמד

source: Having trouble?
he: נתקל בבעיה?

source: Help you any where
he: עזרה מכל מקום

source: Home
he: בית

source: How do you want to use Math Connect? You can change this later in settings.
he: איך תרצה להשתמש ב־Math Connect? תוכל לשנות זאת מאוחר יותר בהגדרות.

source: I agree to the
he: אני מסכים ל

source: I am a Student
he: אני תלמיד

source: I am a Teacher
he: אני מורה

source: I confirm that the uploaded documents are authentic and belong to me. I agree to the Verification Terms.
he: אני מאשר שהמסמכים שהועלו אמיתיים ושייכים לי. אני מסכים לתנאי האימות.

source: Incomplete
he: לא הושלם

source: Israeli Shekel
he: שקל ישראלי

source: Just now
he: עכשיו

source: Language
he: שפה

source: LANGUAGE
he: שפה

source: Lesson
he: שיעור

source: Lesson History
he: שיעורים אחרונים

source: Lesson transcript will appear here when available.
he: תמלול השיעור יופיע כאן כשיהיה זמין.

source: Lessons
he: שיעורים

source: Light
he: בהיר

source: Live Earnings
he: הכנסות בזמן אמת

source: Live Earnings Today
he: הכנסות היום בזמן אמת

source: Live Queue
he: תור חי

source: Loading messages
he: טוען הודעות

source: Loading session details
he: טוען פרטי שיעור

source: Loading your profile…
he: טוען את הפרופיל שלך…

source: Locale
he: אזור ושפה

source: Log In
he: התחבר

source: Log in to Math Connect to continue your journey.
he: התחבר כדי להמשיך את הדרך שלך.

source: Log Out
he: התנתק

source: Low Balance
he: יתרה נמוכה

source: Make sure your microphone is enabled for the best learning experience.
he: ודא שהמיקרופון מופעל כדי לקבל את חוויית הלמידה הטובה ביותר.

source: Manage
he: ניהול

source: Manage bank details & history
he: ניהול פרטי בנק והיסטוריה

source: Manage saved cards and billing details securely with our payment provider.
he: נהל כרטיסי אשראי ותשלומים מאובטחים עם נותני השירות שלנו

source: Math
he: מתמטיקה

source: Math Teacher
he: מורה למתמטיקה

source: Member
he: חבר

source: Member since %@
he: חבר מאז %@

source: Message
he: הודעה

source: Messages
he: הודעות

source: Mic
he: מיקרופון

source: Microphone
he: מיקרופון

source: Microphone Disabled
he: מיקרופון כבוי

source: Microphone Enabled
he: מיקרופון פועל

source: Microphone Permission
he: הרשאת מיקרופון

source: Min. 6 characters
he: לפחות 6 תווים

source: minutes
he: דקות

source: Must be at least 6 characters.
he: חייב להכיל לפחות 6 תווים.

source: Name
he: שם

source: New updates and personal messages will appear here.
he: עדכונים חדשים והודעות אישיות יופיעו כאן.

source: No email address is attached to this account.
he: לא משויכת כתובת אימייל לחשבון זה.

source: No lessons yet. Ask a teacher to get started!
he: עדיין אין שיעורים. שאל מורה כדי להתחיל!

source: No messages
he: אין הודעות

source: No payment was taken. You can choose a plan again when you are ready
he: התשלום לא בוצע. אפר לבחור תוכנית שוב כשמוכנים.

source: No Teachers Available
he: אין מורים זמינים

source: Not enough time left. Please purchase more minutes.
he: לא נשאר מספיק זמן אנא רכוש עוד דקות

source: Not now, use limited mode
he: לא עכשיו, השתמש במצב מוגבל

source: Not requested
he: לא התבקש

source: Notification Preferences
he: העדפות התראות

source: Notification preferences will be available here.
he: העדפות התראות יהיו זמינות כאן.

source: Notifications
he: התראות

source: Notify me about general announcements
he: שלחו לי התראות על הודעות כלליות

source: Notify me when a teacher sends an incoming message
he: שלחו לי התראה כשמורה שולח הודעה נכנסת

source: Off
he: כבוי

source: OFF
he: כבוי

source: OK
he: אישור

source: On
he: פועל

source: ON
he: פעיל

source: On-demand help
he: עזרה לפי דרישה

source: Open Payment Settings
he: פתח הגדרות תשלום

source: Optional
he: אופציונלי

source: Or continue with
he: או המשך עם

source: Original Question
he: השאלה המקורית

source: ORIGINAL QUESTION
he: השאלה המקורית

source: OS Version
he: גרסת מערכת הפעלה

source: Password
he: סיסמה

source: Password management will be available here.
he: ניהול סיסמה יהיה זמין כאן.

source: Password must be at least 6 characters.
he: הסיסמה חייבת להכיל לפחות 6 תווים.

source: Password reset email sent.
he: אימייל לאיפוס הסיסמה נשלח.

source: Password, logout and account removal
he: סיסמה, התנתקות ומחיקת חשבון

source: Past Lessons
he: שיעורים קודמים

source: Payment
he: תשלום

source: Payment Cancelled
he: התשלום בוטל

source: Payment Complete
he: התשלום בוצע

source: Payment Confirmation Pending
he: אישור התשלום בהמתנה

source: Payment Failed
he: התשלום נכשל

source: Payment Methods
he: אמצעי תשלום

source: Payment returned with status: %@
he: התשלום חזר עם סטטוס: %@

source: Payment Update
he: עידכון תשלום

source: Payments
he: תשלומים

source: PAYMENTS
he: תשלומים

source: Payout Details Missing
he: חסרים פרטי תשלום

source: PAYOUTS
he: תשלומים למורה

source: PayPal at checkout
he: PayPal בזמן התשלום

source: PayPal Checkout
he: תשלום ב־PayPal

source: PayPal Email
he: אימייל PayPal

source: PayPal payout email updated.
he: אימייל התשלום ב־PayPal עודכן.

source: PayPal Payouts
he: תשלומי PayPal

source: PDF, JPG or PNG (Max 5MB)
he: PDF, JPG או PNG (עד 5MB)

source: Pending Verification
he: ממתין לאימות

source: Per-minute billing
he: חיוב לפי דקות

source: Permanently remove your account
he: מחק את חשבונך לצמיתות

source: Phone
he: טלפון

source: Phone Number
he: מספר טלפון

source: Physics
he: פיזיקה

source: Please enter a valid email address.
he: יש צורך להכניס כתובת חוקית

source: PREFERENCES
he: העדפות

source: Preview
he: תצוגה מקדימה

source: Preview and Submit
he: תצוגה מקדימה ושליחה

source: Preview only. No account was deleted.
he: תצוגה מקדימה בלבד. החשבון לא נמחק.

source: Pricing Option
he: אפשרויות תמחור

source: Pricing Options
he: אפשרויות תמחור

source: Privacy
he: פרטיות

source: Privacy Controls
he: בקרות פרטיות

source: Privacy controls will be available here.
he: בקרות פרטיות יהיו זמינות כאן.

source: Privacy Policy
he: מדיניות פרטיות

source: Privacy Policy.
he: מדיניות הפרטיות.

source: Privacy Protected
he: פרטיות מוגנת

source: Privacy.
he: פרטיות.

source: Profile
he: פרופיל

source: Purchase Not Completed
he: הרכישה לא הושלמה

source: QUESTION
he: שאלה

source: Question details are loading.
he: פרטי השאלה נטענים.

source: Readiness Checklist
he: רשימת מוכנות

source: Ready
he: מוכן

source: Recent Lessons
he: שיעורים אחרונים

source: Recently
he: לאחרונה

source: Regular
he: רגיל

source: required
he: חובה

source: Required
he: חובה

source: Required for voice sessions.
he: נדרש לשיעורי שמע.

source: Resend Code Now
he: שלח קוד מחדש עכשיו

source: Reset Password
he: איפוס סיסמה

source: Save Changes
he: שמור שינויים

source: Save PayPal Info
he: שמירת פרטי PayPal

source: Saving...
he: שומר...

source: Search lessons or students
he: חפש שיעורים או תלמידים

source: Search lessons or teachers
he: חפש שיעורים או מורים

source: Search subjects or subtopics
he: חפש נושאים או תתי־נושאים

source: Searching for a teacher…
he: מחפש מורה…

source: SECONDS
he: שניות

source: Select
he: בחר

source: Select Tier
he: בחר רמה

source: Selfie Verification
he: אימות סלפי

source: Send
he: שלח

source: Send a message to support. You will preview the data before it is sent.
he: שלח הודעה לתמיכה. תוכל לראות תצוגה מקדימה של הנתונים לפני השליחה.

source: Send a password reset email to the email address on this account.
he: שלח אימייל לאיפוס סיסמה לכתובת האימייל בחשבון זה.

source: Send me occasional updates and tips about Math Connect.
he: שלחו לי מדי פעם עדכונים וטיפים על Math Connect.

# Send me occasional updates and tips about Math Connect.
source: Send me occasional updates and tips about\nMath Connect.
he: שלח לי עידכונים לעיתים על האפליקציה

source: Send Reset Email
he: שלח אימייל לאיפוס

source: Send Reset Link
he: שלח איפוס סיסמה

source: Sent %@
he: נשלח %@

source: Session Cost
he: עלות השיעור

source: Session started - Billing active
he: השיעור התחיל - החיוב פעיל

source: Session Time
he: זמן שיעור

source: Session type
he: סוג שיעור

source: Setting up the session
he: מתחבר לשיעור

source: Setting up your session
he: מגדיר את השיעור שלך

source: Settings
he: הגדרות

source: Show my profile image
he: הצג את תמונת הפרופיל שלי

source: Sign In Error
he: שגיאת התחברות

source: Sign Up
he: הרשמה

source: Signing in…
he: מתחבר…

source: Signing In…
he: מתחבר…

source: Solved
he: נפתר

source: Specify the exact topic (e.g., “Derivatives”)
he: הגדר את הבעיה בצורה מדוייקת (לדוגמה: נגזרות)

source: Start with a text explanation, then use the board below for the math work.
he: התחל בהסבר טקסטואלי, ואז השתמש בלוח שלמטה לעבודה המתמטית.

source: Statistics
he: סטטיסטיקה

source: Status
he: מצב

source: Step 1 of 2
he: שלב 1 מתוך 2

source: Step 2 of 2
he: שלב 2 מתוך 2

source: Student
he: תלמיד

source: Student Payment Methods
he: אמצעי תשלום

source: Subject Area
he: תחום לימוד

source: Subjects
he: מקצועות

source: Submit for Review
he: שליחה לבדיקה

source: Summary
he: סיכום

source: Support email is not configured correctly.
he: כתובת הדוא״ל לתמיכה אינה מוגדרת כראוי.

source: System
he: מערכת

source: System Language
he: שפת המערכת

source: Take a clear selfie to match with your Government ID.
he: צלם סלפי ברור להתאמה לתעודת הזהות שלך.

source: Take Selfie
he: צלם סלפי

# Talk live with teachers to solve math problems together in real- time.
source: Talk live with\nteachers to solve\nmath problems\ntogether in real-\ntime.
he: דבר בזמן אמת\nעם מורים לפתור\nבעיות מתמטיות ביחד

source: Tap to upload document
he: הקש להעלאת מסמך

source: Teacher
he: מורה

source: Teacher Dashboard
he: לוח המורה

source: Teacher Found!
he: נמצא מורה!

source: Teacher in a Minute App
he: אפליקציית מורה בדקה

source: Teacher Payout Settings
he: הגדרות תשלום למורה

source: Teachers must add and keep a valid PayPal email in order to receive payouts. Payments cannot be sent until this information is valid.
he: מורים חייבים להוסיף ולשמור אימייל PayPal תקין כדי לקבל תשלומים. לא ניתן לשלוח תשלומים עד שהמידע הזה תקין.

source: Teaching Credentials
he: אישורי הוראה

source: Teaching Details
he: נתוני לימוד

source: Tell us a bit about yourself to get started with Math Connect.
he: ספר לנו קצת על עצמך כדי להתחיל עם Math Connect.

source: Terms
he: תנאים

source: Terms of Service
he: תנאי השימוש

source: Text
he: טקסט

source: The payment did not complete. Please try again.
he: התשלום לא הושלם. בבקשה נסה שינית.

source: The purchase did not complete. If you were charged, your account will update after payment confirmation.
he: הרכישה לא הושלמה. אם בוצע חיוב, החשבון יעודכן לאחר אישור התשלום.

source: This permanently deletes your account and profile data. This cannot be undone.
he: פעולה זו תמחק לצמיתות את החשבון ונתוני הפרופיל שלך. לא ניתן לבטל זאת.

source: This usually takes under 30 seconds.
he: בדרך כלל זה לוקח פחות מ־30 שניות.

source: This Week
he: השבוע

source: Time Learned
he: זמן שנלמד

source: Time Sent
he: זמן שליחה

source: Tips for faster matches
he: טיפים להתאמות מהירות יותר

source: Title
he: כותרת

source: To give you the best math tutoring experience, we need a couple of permissions to connect you instantly.
he: כדי לתת לך את חוויית לימוד המתמטיקה הטובה ביותר, אנחנו צריכים כמה הרשאות כדי לחבר אותך מיידית.

source: To maintain a high-quality learning environment, we need to verify your teaching credentials and identity.
he: כדי לשמור על סביבת למידה איכותית, עלינו לאמת את פרטי ההוראה ואת הזהות שלך.

source: Today
he: היום

source: Today we support PayPal only. Students do not need to save a payment method in the app; PayPal asks for the student credentials during each purchase.
he: כרגע אנחנו תומכים רק ב־PayPal. תלמידים לא צריכים לשמור אמצעי תשלום באפליקציה; PayPal יבקש את פרטי ההתחברות של התלמיד בכל רכישה.

source: Topic
he: נושא

source: Total minutes tutored
he: סך דקות הוראה

source: Total Purchased
he: סה״כ נרכש

source: Total so far
he: סה״כ עד עכשיו

source: Total Spend
he: סך כל ההוצאה הקרובה

source: Transcript Preview
he: תצוגה מקדימה של התמלול

source: Trigonometry
he: טריגונומטריה

source: Unknown
he: לא ידוע

source: Update PayPal payout email
he: עדכון אימייל תשלום ב־PayPal

source: Update the details students and teachers use to recognize and contact you.
he: עדכן את הפרטים כך שתלמידים ומורים יוכלו לזהות אותך ולהתקשר איתך

source: Upload a clear photo of your math problem
he: העלה תמונה ברורה של הבעיה המתמטית שלך

source: Upload a clear photo of your passport, driver's license, or national ID.
he: העלה תמונה ברורה של הדרכון, רישיון הנהיגה או תעודת הזהות שלך.

source: Upload the front side of your ID to continue
he: העלה את הצד הקדמי של התעודה כדי להמשיך

source: Upload your degree, teaching license, or relevant certifications.
he: העלה את התואר, רישיון ההוראה או אישורים רלוונטיים.

source: Uploading selfie…
he: מעלה סלפי…

source: Uploading…
he: מעלה…

source: US Dollar
he: דולר אמריקאי

source: Use the device language
he: השתמש בשפת המכשיר

source: Use video in live\\nlessons and update\\nyour profile photo\\nwhen needed.
he: שימוש בשיחת וידאו לשיעורים ולתמונת פרופיל כשנדרש

source: Use your finger to write or sketch.
he: השתמש באצבע כדי לכתוב או לשרטט.

source: User ID
he: מזהה משתמש

source: Verification required
he: נדרש אימות

source: VERIFICATION STATUS
he: סטטוס אימות

source: Verified
he: מאומת

source: Verified Expert
he: מומחה מאומת

source: Verified Tutors
he: מורים מאומתים

source: Verify Your Identity
he: אמת את זהותך

source: Verify your number
he: אמת את המספר שלך

source: Video + Audio + Text
he: וידאו + אודיו + טקסט

source: Video message
he: הודעת וידאו

source: View all
he: הצג הכל

source: Voice Message
he: הודעה קולית

source: WAITING
he: ממתין

source: Waiting for students...
he: ממתין לתלמידים...

source: Waiting now
he: ממתין עכשיו

source: We have not received PayPal confirmation yet. If payment was approved, your account will update after PayPal confirms it.
he: עדיין לא קיבלנו אישור מ־PayPal. אם התשלום אושר, החשבון שלך יתעדכן לאחר ש־PayPal יאשר אותו.

source: We've sent a 4-digit security code to
he: שלחנו קוד אבטחה בן 4 ספרות אל

source: Welcome Back
he: ברוך השב

source: What can we help with?
he: במה אפשר לעזור?

source: What can you teach?
he: מה אתה יכול ללמד?

source: with %@
he: עם %@

source: Yesterday
he: אתמול

source: You have %@ remaining. You need at least 2 minutes to ask a teacher. Please buy more minutes to continue.
he: נשארו לך %@ דקות על מנת לשאול מורה יש צורך ב 2 דק לפחות. בבקשה לרכוש עוד חבילת דקות

source: You may need to log in again before deleting your account.
he: ייתכן שתידרש להתחבר שוב לפני מחיקת החשבון.

source: You must agree to the Terms of Service and Privacy Policy to continue.
he: עליך להסכים לתנאי השירות ולמדיניות הפרטיות כדי להמשיך.

source: You will not receive money until you provide bank account details or PayPal info.
he: לא תקבל כסף עד שתספק פרטי חשבון בנק או פרטי PayPal.

source: You're Offline
he: אתה לא מחובר

source: You're Online
he: אתה מחובר

source: Your documents are securely encrypted and only used for verification purposes. They will not be shared publicly on your profile.
he: המסמכים שלך מוצפנים באופן מאובטח ומשמשים רק למטרות אימות. הם לא ישותפו באופן ציבורי בפרופיל שלך.

source: Your Grade
he: הכיתה שלך

source: Your message was sent.
he: ההודעה שלך נשלחה.

source: Your payment was completed successfully.
he: התשלום הושלם בהצלחה

source: Your Privacy Matters
he: הפרטיות שלך חשובה

source: Your question
he: השאלה שלך

source: Your session is ready. Room: %@
he: השיעור שלך מוכן. חדר: %@

source: Your share (%d%%)
he: החלק שלך (%d%%)

source: Your teacher will join shortly
he: המורה שלך יצטרף בקרוב
